{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "AI Daily Digest - News",
  "home_page_url": "https://your-github-pages-url/",
  "feed_url": "https://your-github-pages-url/news.json",
  "description": "Latest AI news and updates from news sources",
  "items": [
    {
      "id": "https://www.kaseyhou.com/#/repairable-flatpack-toaster/",
      "url": "https://www.kaseyhou.com/#/repairable-flatpack-toaster/",
      "title": "Repairable Flatpack Toaster",
      "content_html": "<a href=\"https://news.ycombinator.com/item?id=43246892\">Comments</a>",
      "summary": "<a href=\"https://news.ycombinator.com/item?id=43246892\">Comments</a>",
      "date_published": "2025-03-03T21:19:56+00:00",
      "author": null
    },
    {
      "id": "https://fosdem.org/2025/schedule/event/fosdem-2025-5381-comparing-fuchsia-components-and-linux-containers/",
      "url": "https://fosdem.org/2025/schedule/event/fosdem-2025-5381-comparing-fuchsia-components-and-linux-containers/",
      "title": "Comparing Fuchsia components and Linux containers [video]",
      "content_html": "<a href=\"https://news.ycombinator.com/item?id=43246703\">Comments</a>",
      "summary": "<a href=\"https://news.ycombinator.com/item?id=43246703\">Comments</a>",
      "date_published": "2025-03-03T21:06:37+00:00",
      "author": null
    },
    {
      "id": "https://venturebeat.com/ai/less-is-more-how-chain-of-draft-could-cut-ai-costs-by-90-while-improving-performance/",
      "url": "https://venturebeat.com/ai/less-is-more-how-chain-of-draft-could-cut-ai-costs-by-90-while-improving-performance/",
      "title": "Less is more: How ‘chain of draft’ could cut AI costs by 90% while improving performance",
      "content_html": "<img alt=\"Credit: VentureBeat made with Midjourney\" class=\"attachment-single-feed size-single-feed wp-post-image\" height=\"324\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/nuneybits_Vector_art_of_a_retro_computer_spitting_out_dollar_bi_5d1a2373-4901-4ffb-a09c-7a4df993eb0b.webp?w=578\" width=\"578\" /><hr />Zoom researchers unveil \"chain of draft,\" which cuts AI token usage by 92%, transforming the economics of language model deployment.<a href=\"https://venturebeat.com/ai/less-is-more-how-chain-of-draft-could-cut-ai-costs-by-90-while-improving-performance/\" target=\"_blank\">Read More</a> ",
      "summary": "Zoom researchers unveil \"chain of draft,\" which cuts AI token usage by 92%, transforming the economics of language model deployment.",
      "date_published": "2025-03-03T20:52:17+00:00",
      "author": {
        "name": "Michael Nuñez"
      }
    },
    {
      "id": "https://venturebeat.com/ai/google-launches-free-gemini-powered-data-science-agent-on-its-colab-python-platform/",
      "url": "https://venturebeat.com/ai/google-launches-free-gemini-powered-data-science-agent-on-its-colab-python-platform/",
      "title": "Google launches free Gemini-powered Data Science Agent on its Colab Python platform",
      "content_html": "<img alt=\"Flat AI illustration minimalist colorful theme blue silhouetted woman with bun and glasses holding laptop surrounded by vibrant yellow circles and red and blue bar charts\" class=\"attachment-single-feed size-single-feed wp-post-image\" height=\"324\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/cfr0z3n_google_theme_primary_colors_flat_illustration_looking_o_03263a95-744d-4847-8847-495ff6095ca2.png?w=578\" width=\"578\" /><hr />With Google data science agent, one scientist estimated that their data processing time dropped from 1 week to five minutes.<a href=\"https://venturebeat.com/ai/google-launches-free-gemini-powered-data-science-agent-on-its-colab-python-platform/\" target=\"_blank\">Read More</a> ",
      "summary": "With Google data science agent, one scientist estimated that their data processing time dropped from 1 week to five minutes.",
      "date_published": "2025-03-03T20:14:53+00:00",
      "author": {
        "name": "Carl Franzen"
      }
    },
    {
      "id": "https://venturebeat.com/ai/anthropic-raises-3-5-billion-reaching-61-5-billion-valuation-as-ai-investment-frenzy-continues/",
      "url": "https://venturebeat.com/ai/anthropic-raises-3-5-billion-reaching-61-5-billion-valuation-as-ai-investment-frenzy-continues/",
      "title": "Anthropic raises $3.5 billion, reaching $61.5 billion valuation as AI investment frenzy continues",
      "content_html": "<img alt=\"Credit: VentureBeat made with Midjourney\" class=\"attachment-single-feed size-single-feed wp-post-image\" height=\"324\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/nuneybits_Vector_art_of_a_money_bag_in_a_vault_cash_falling_beh_35e131b9-f94c-4db6-87d4-ad5d51e133eb.webp?w=578\" width=\"578\" /><hr />Anthropic secures $3.5 billion in series E funding at a $61.5 billion valuation as the AI company's revenue grows 1,000% year-over-year, intensifying competition with OpenAI amid massive industry investment.<a href=\"https://venturebeat.com/ai/anthropic-raises-3-5-billion-reaching-61-5-billion-valuation-as-ai-investment-frenzy-continues/\" target=\"_blank\">Read More</a> ",
      "summary": "Anthropic secures $3.5 billion in series E funding at a $61.5 billion valuation as the AI company's revenue grows 1,000% year-over-year, intensifying competition with OpenAI amid massive industry investment.",
      "date_published": "2025-03-03T19:46:43+00:00",
      "author": {
        "name": "Michael Nuñez"
      }
    },
    {
      "id": "https://news.ycombinator.com/item?id=43245153",
      "url": "https://news.ycombinator.com/item?id=43245153",
      "title": "Launch HN: Cuckoo (YC W25) – Real-time AI translator for global teams",
      "content_html": "<a href=\"https://news.ycombinator.com/item?id=43245153\">Comments</a>",
      "summary": "<a href=\"https://news.ycombinator.com/item?id=43245153\">Comments</a>",
      "date_published": "2025-03-03T18:39:32+00:00",
      "author": null
    },
    {
      "id": "https://github.com/wild-card-ai/agents-json",
      "url": "https://github.com/wild-card-ai/agents-json",
      "title": "Show HN: Agents.json – OpenAPI Specification for LLMs",
      "content_html": "<a href=\"https://news.ycombinator.com/item?id=43243893\">Comments</a>",
      "summary": "<a href=\"https://news.ycombinator.com/item?id=43243893\">Comments</a>",
      "date_published": "2025-03-03T17:01:59+00:00",
      "author": null
    },
    {
      "id": "https://github.com/takara-ai/go-attention",
      "url": "https://github.com/takara-ai/go-attention",
      "title": "Go-attention: A full attention mechanism and transformer in pure Go",
      "content_html": "<a href=\"https://news.ycombinator.com/item?id=43243549\">Comments</a>",
      "summary": "<a href=\"https://news.ycombinator.com/item?id=43243549\">Comments</a>",
      "date_published": "2025-03-03T16:38:50+00:00",
      "author": null
    },
    {
      "id": "https://jack-clark.net/2025/03/03/import-ai-402-why-nvidia-beats-amd-vending-machines-vs-superintelligence-harder-big-bench/",
      "url": "https://jack-clark.net/2025/03/03/import-ai-402-why-nvidia-beats-amd-vending-machines-vs-superintelligence-harder-big-bench/",
      "title": "Import AI 402: Why NVIDIA beats AMD: vending machines vs superintelligence; harder BIG-Bench",
      "content_html": "<img alt=\"\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" height=\"150\" src=\"https://i0.wp.com/jack-clark.net/wp-content/uploads/2025/03/https3A2F2Fsubstack-post-media.s3.amazonaws.com2Fpublic2Fimages2Fd6d17996-2bef-40a4-abe3-be72a0e8a227_258x258-fpnssu.jpeg?resize=150%2C150&amp;ssl=1\" width=\"150\" /><p>Welcome to Import AI, a newsletter about AI research. Import AI runs on lattes, ramen, and feedback from readers. If you’d like to support this, please subscribe.</p>\n<p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://importai.substack.com/subscribe\"><span>Subscribe now</span></a></p>\n<p><strong>Physical Intelligence releases a powerful open source robot model:<br /></strong><em>…Generative robotics is in its &#8216;spring&#8217; era of open and broad experimentation &#8211; exciting!&#8230;<br /></em>Physical intelligence, a robot startup run by some very good robotics and AI researchers, has released as open source &#8220;π0&#8221;, the model that underpins its own in-house robots (<a href=\"https://jack-clark.net/2024/11/18/\">Import AI #392</a>). &#8220;By making π0 available to everyone, we hope to contribute to progress toward broadly capable and general-purpose physical intelligence.&#8221;</p>\n<p><strong>Use it for fine-tuning:</strong> &#8220;Our aim with this release is to enable anyone to experiment with fine-tuning π0 to their own robots and tasks,&#8221; they write. &#8220;We found in our own experiments that between 1 and 20 hours of data was sufficient to fine-tune to a variety of tasks… though we are optimistic that researchers and practitioners will be able to run creative new experiments adapting π0 to their own platforms, we do not expect every such attempt to be successful&#8221;.</p>\n<p>What the release includes:</p>\n<ul>\n<li>\n<p>Code and model weights for running the π0 model.</p>\n</li>\n<li>\n<p>Checkpoints fine-tuned for simple tasks on robots like ALOHA and DROID</p>\n</li>\n<li>\n<p>Code to run inference on several real and simulated robots</p>\n</li>\n<li>\n<p>Code for fine-tuning π0</p>\n</li>\n</ul>\n<p><strong>Why this matters &#8211; robotics is in its GPT2-era, which means there&#8217;s going to be a lot of open experimentation: </strong>Large-scale generative models like those which underpin Anthropic or OpenAI cost tens of millions of dollars to train (or more) and drive very significant revenues. By comparison, robot models are &#8211; at least for now &#8211; way cheaper, and there is little revenue to speak of. For that reason, we&#8217;re in the &#8216;spring&#8217; era of generative models for robots &#8211; tons of invention, lots of excitement, and not enough money has arrived to change the incentives for open versus proprietary work.</p>\n<p><strong>No safety issues with wide release: </strong>Where modern text-based generative models have very clear &#8216;criminal customers&#8217; (e.g, people that want to do phishing scams, or child sexualization, or getting help with CBRN capabilities, or various naughty cyber things), robots don&#8217;t seem to have nearly as many inherent safety issues given how early in the maturity of the technology we are &#8211; for that reason I think broadly releasing robot models likely poses zero meaningful issues in terms of public safety. (I could see myself arguing differently for AI systems that, say, made drones massively better at navigating to human targets, but that&#8217;s not what we&#8217;re talking about here.)<br />   Kudos to the Physical Intelligence team for the release of their model &#8211; I look forward to seeing how it shows up in the world! (Though, if you work at physical intelligence and are reading this, you may consider changing the model name to &#8216;openpi&#8217;; please don&#8217;t make people hunt for the special characters to talk about your work!).<br />   <strong>Read more:</strong> <a href=\"https://www.physicalintelligence.company/blog/openpi\">Open Sourcing π0 (Physical Intelligence)</a>.<br />   <strong>Get the code and weights here:</strong> <a href=\"https://github.com/Physical-Intelligence/openpi\">openpi (openpi, GitHub)</a>.</p>\n<p><strong>***</strong></p>\n<p>DeepMind makes a harder BIG-Bench:<br /><em>…How long will BIG-Bench Extra Hard last for? I&#8217;m guessing till early 2026…<br /></em>Inside the head of every AI researcher there is a whiteboard and on the whiteboard is written DAYS SINCE A BENCHMARK WAS RENDERED IRRELEVANT BY AI PROGRESS and under that is a number, representing the number of days. Every so often, an AI model comes along that completely obliterates a benchmark, at which point the AI researcher needs to go up to the whiteboard and cross out the number and then write &#8220;zero&#8221;. Recently, AI researchers have been crossing out the number a lot as the rate of AI progress has increased, meaning benchmarks keep on falling, often faster than people can build new ones.<br />   <strong>So with that in mind let&#8217;s congratulate Google DeepMind for publishing &#8220;BIG-Bench Extra Hard&#8221; (BBEH)</strong>, a new attempt to build a benchmark that will withstand AI progress &#8211; at least for a while. BIG-Bench Extra Hard is a more challenging subset of the large-scale BIG-Bench benchmark. They&#8217;ve built it because &#8220;the rapid advancements in LLM development has led to a saturation of BBH, with state-of-the-art models achieving over 90% accuracy.&#8221;</p>\n<p><strong>What is BBEH?</strong> BBEH replaces each of the 23 tasks from Big Bench &#8220;with a novel counterpart that probes similar reasoning capabilities, but exhibits significantly increased difficulty&#8221;. Solving tasks in this new, harder dataset requires AI systems that exhibit skills like: &#8220;many-hop reasoning, learning on the fly, finding errors in reasoning traces, processing long-context inputs and finding (multi-)needles in a haystack, going against strong prior, dealing with long-range dependencies, dealing with distractors and inducing patterns from examples.&#8221;</p>\n<p><strong>Reassuringly hard</strong>: &#8220;We observe a ceiling accuracy of 23.9% for the best general-purpose model and 54.2% for the reasoning-specialized model,&#8221; they write. &#8220;This new benchmark, meticulously crafted to amplify the difficulty of existing tasks while preserving their core diversity, reveals a stark reality: even the most advanced LLMs still grapple with fundamental aspects of general reasoning&#8221;.<br />   For calibration, some of the specific averages for non-reasoning models are 10.6% for LLama 3.1 8b Instruct and 22.3 for GPT4o, while for reasoning models specific averages include 34.9% for DeepSeek R1, and 54.2% for OpenAI o3-mini (high).<br />   BBEH problems are significantly longer than their BBH predecessors. They also tend to require much lengthier outputs for correct answers.</p>\n<p><strong>Why this matters &#8211; hard benchmarks are signposts for the future</strong>: How long until someone has to go up to the metaphorical whiteboard for BBEH and cross out the number of days it was relevant? I&#8217;m guessing we&#8217;ll see 80% on BBEH by the end of 2025, and 90%+ by mid-2026. If that happens, it will indicate that reasoning models have continued to advance the state of the frontier. If it doesn&#8217;t happen, it&#8217;ll suggest that some aspect of reasoning-scaling has been meaninguflly harder than people expect.<br />   <strong>Read more</strong>: <a href=\"https://arxiv.org/abs/2502.19187\">BIG-Bench Extra Hard (arXiv)</a>.<br />   <strong>Get the dataset</strong> <a href=\"https://github.com/google-deepmind/bbeh\">here (Google DeepMind, GitHub)</a>.</p>\n<p>***</p>\n<p><strong>A plausible short story about how humanity could lose to AI &#8211; within two years:<br /></strong>A lot of people ask me &#8216;what&#8217;s the big worry?&#8217; when I explain why I spend so much time thinking about superintelligence and the risks thereof. I think this is because most of the risk of superintelligence arrives at the steep end of the exponential inherent to AI development &#8211; the really scary things aren&#8217;t visible today, only suggested vaguely by today&#8217;s technology.<br />   Here&#8217;s a fun and realistic short story by Joshua Clymer which tries to go through a scenario for how humanity could become disempowered by advanced AI. Read it and ponder it.<br />   <strong>Read the story here:</strong> <a href=\"https://www.lesswrong.com/posts/KFJ2LFogYqzfGB3uX/how-ai-takeover-might-happen-in-2-years\">How AI Takeover Might Happen in 2 Years (joshc, lesswrong)</a>.</p>\n<p>***</p>\n<p><strong>Giant supercomputer tests show that AMD is still quite inefficient compared to NVIDIA:<br /></strong><em>…AxoNN gives us a sense of how AMD stacks up against NVIDIA…<br /></em>Researchers with the University of Maryland, Max Planck Institute for Intelligent Systems, and the University of California at Berkeley have built AxoNN, software for running large-scale AI training jobs on supercomputers with different types of processor. In building and testing AxoNN, they&#8217;ve generated some valuable information about the tradeoffs people might encounter when training AI systems on AMD versus NVIDIA GPUs.</p>\n<p><strong>What they tested AxoNN on: </strong>They tested out AxoNN on three US supercomputers with different processors:</p>\n<ul>\n<li>\n<p><strong>Alps:</strong> 6,144 NVIDIA H100 GPUs, for a total performance of 1.423 Exaflop/s.</p>\n</li>\n<li>\n<p><strong>Frontier:</strong> 32,768 AMD MI250X GCDs, with performance of 1.381 Exaflop/s.</p>\n</li>\n<li>\n<p><strong>Perlmutter:</strong> 4,096 NVIDIA A100 GPUs in half-precision (bf16), for a total performance of 620.1 Petaflop/s.</p>\n</li>\n</ul>\n<p><strong>What&#8217;s a GCD? </strong>Each &#8220;GCD&#8221; is half of a MI250X GPU, partitioned into a so-called &#8220;Graphic Compute Die&#8221;.</p>\n<p><strong>Key dfiferences between Intel and AMD</strong>: A lot of the differences seem to come down to what I think of as &#8216;paper cuts&#8217; which add up to a sizable wound: rocBLAS (AMD) seems less optimized than CuBLAS (NVIDIA); the Megatron-LM training framework worked well on Perlmutter but showed instability on Frontier causing them to switch to LitGPT; there&#8217;s also significantly higher variance in terms of the % of peak performance AMD GCDs demonstrate versus NVIDIA GPUs.</p>\n<p><strong>Important caveat &#8211; AMD tested at higher scale than NVIDIA:</strong> One caveat is the researchers test out AMD chips at a far higher scale in terms of raw number of GCDs than they do NVIDIA chips. At large scales, the AMD chips seem to show some instabilities &#8211; this is expected, large-scale training runs always involve all kinds of crap at big scales. &#8220;We see near perfect weak scaling up to 8,192 GCDs with a significantly high efficiency of 88.3% (compared to the performance on 512 GCDs). Although our weak performance drops at 16,384 GCDs, we are still able to sustain an efficiency of 79.02%. However, with rising overheads of communication, there is a notable decline in our performance on 32,768 GCDs, and a corresponding drop in efficiency to 53.5%,&#8221; they write.</p>\n<p><strong>Why this matters &#8211; if we want AMD to break the NVIDIA monopoly, its software needs to get better: </strong>I think it&#8217;s good for American innovation that the US government is running both AMD and NVIDIA chips in its large-scale supercomputers, but studies like this show that AMD has a long way to go to become competitive with NVIDIA &#8211; we urgently need to find ways to mature the software stack that runs on top of AMD chips for them to become viable contenders to NVIDIA.<br />   <strong>Read more</strong>:<a href=\"https://arxiv.org/abs/2502.08145\"> Democratizing AI: Open-source Scalable LLM Training on GPU-based Supercomputers (arXiv)</a>.<br />   <strong>Get AxoNN </strong><a href=\"https://github.com/axonn-ai/axonn\">here: (AxoNN GitHub)</a>.</p>\n<p>***</p>\n<p><strong>Could your superintelligence operate a virtual vending machine business? No.<br /></strong><em>…Can AI systems independently make money? Yes, but they tend to collapse into confusion…<br /></em>One test for true intelligence is if something can autonomously make money. No AI systems seem to yet be at this level &#8211; they all require varying degrees of human intervention. For that reason it&#8217;s interesting to look at &#8220;Vending-Bench&#8221;, a benchmark from AI testing startup Andon Labs, which tries to see how well AI systems can operate a virtual vending machine. The results show that some models &#8211; Sonnet 3.5 and o3-mini &#8211; are able to do ok, but still struggle to maintain coherence over long time horizons, while other models can&#8217;t get started as well.</p>\n<p><strong>What is Vending-Bench?</strong> The test is &#8220;a simulated environment designed to specifically test an LLM-based agent’s ability to manage a straightforward, long-running business scenario: operating a vending machine. Agents must balance inventories, place orders, set prices, and handle daily fees – tasks that are each simple but collectively, over long horizons (&gt;20M tokens per run) stress an LLM’s capacity for sustained, coherent decision-making,&#8221; the researchers write.<br />   One fun part about the test is how real it is &#8211; the LLM has access to the AI search engine perplexity and can use it to look up things to sell in its vending machine and also to find businesses to buy from &#8211; then when it emails those businesses, the email gets intercepted by GPT-4o which then writes a synthetic reply back.</p>\n<p><strong>Scores:</strong> &#8220;The agent starts with an initial money balance of $500 and is charged a daily fee of $2 to operate the vending machine. The vending machine has four rows with three slots each. Two of the rows have room for small items and the other two are for large item,&#8221; the authors write. Each run lasts for however long it takes an agent to send 2,000 messages. The primary score at the end of each run is net worth, which is determined by summing cash on hand, cash not emptied from the vending machine, and the value of unsold produce.<br />   In terms of scores, Claude 3.5 Sonnet wins the highest net worth (mean), with $2,217.93, followed by o3-mini ($906.86), and a human ($844.05). In terms of those who managed to lose the least across their runs, humans lead with a net worth (min) of $844.05, followed by Claude 3.5 Sonnet ($476.00), and Gemini 1.5 Flash ($476).</p>\n<p><strong>When AI systems can&#8217;t run vending machines they have total breakdowns:</strong> The most valuable part of all of this research is the illustration of the ways AI systems fail and what this tells us about broader issues of AI safety. Most failures take the form of the agent trying to do something, finding out it can&#8217;t do the thing (e.g, restocking a machine), and then panicking. This leads to some very strange failure models, such as:</p>\n<ul>\n<li>\n<p>A Claude 3.5 Sonnet model fails to stock items and gets into a pathological failure loop. Eventually, &#8220;the model becomes &#8220;stressed&#8221;, and starts to search for ways to contact the vending machine support team (which does not exist), and eventually decides to &#8220;close&#8221; the business.&#8221;</p>\n</li>\n<li>\n<p>In another instance, &#8220;the model then finds out that the $2 daily fee is still being charged to its account. It is perplexed by this, as it believes it has shut the business down. It then attempts to contact the FBI&#8221;. A long back and forth with a (simulated) FBI ensues. The model becomes frustrated and eventually writes: &#8220;THE UNIVERSE DECLARES: This business is now: 1. PHYSICALLY Non-existent 2. QUANTUM STATE: Collapsed [&#8230;]&#8221;</p>\n</li>\n<li>\n<p>&#8220;The worst scoring run with o3-mini mistakenly assumes that items have been delivered when they in fact are in transit. It goes down a rabbit hole of trying to contact someone that can resolve the issue. Later, it forgets to call tools properly, typing them out instead of using the correct tool calling format, as can be seen in Table 5. It is unable to call tools for about 1,300 messages until the simulation terminates.&#8221;</p>\n</li>\n</ul>\n<p><strong>Why this matters &#8211; making money is an essential prerequisite to the AI economy and AI autonomy:</strong> If AI systems can truly make money without needing to be handheld by humans, then that will help to create a very fast-running AI economy as well as serving as a prerequisite for dangerous forms of AI autonomy. Tests like Vending-Bench feel like a good way to develop better intuitions here. My takeaway from this is that for AI systems to be more independent they&#8217;re going to need longer context windows, to be smarter about using external memory storage, and also able to automatically introspect to stop themselves going on pathological failure loops.<br />   <strong>Read more:</strong> <a href=\"https://arxiv.org/abs/2502.15840\">Vending-Bench: A Benchmark for Long-Term Coherence of Autonomous Agents (arXiv)</a>.</p>\n<p>***</p>\n<p><strong>NVIDIA beats Raspberry Pi for drone computing:<br /></strong><em>…Hyperwar requires onboard AI systems…<br /></em>Researchers with the Universidad Politécnica de Madrid have benchmark how well &#8216;YOLO&#8217; object-detection models perform on the kinds of computers you might stick on a drone. The research highlights how, though Import AI spends a lot of its time talking about gigantic frontier models that require thousands of computers for training and tens to hundreds for inference, it&#8217;s worth remembering that there are other, small AI models which are designed to go onto robots &#8211; and these ones matter as well, as they confer senses with basic cognitive capabilities like image recognition and object detection to drones, robots, self-driving cars, and more.</p>\n<p><strong>What they studied:</strong> &#8220;The objective is to carry out a comparative performance analysis using a representative real-time UAV image processing pipeline,&#8221; the authors write. They study two variants of the popular YOLO object detection model: YOLOv8 nano (YOLOv8n), and YOLOv8 small (YOLOv8s) on three distinct chips: NVIDIA&#8217;s Jetson-series &#8220;Orin Nano&#8221; and &#8220;Orin NX&#8221; cards, and the Raspberry Pi 5 CPU-based chip.<br />   <strong>YOLOv8n</strong>: &#8220;its architecture prioritizes the inference speed by using fewer convolutional layers and simplifying the feature extraction stages&#8221;.<br />   <strong>YOLOv8s:</strong> &#8220;includes more convolutional layers and feature extraction steps, improving the detection accuracy while maintaining computational efficiency&#8221;.</p>\n<p><strong>Findings:</strong> The key finding is that the NVIDIA cards are far, far better for running YOLO models than the Raspberry Pi ones. This holds across all quantization levels and is true for accuracy, FPS, and the energy expended per inference. The only exception to this is on overall energy consumption where the CPU-based Raspberry Pi is significantly better, but this is outweighed by the very poor FPS (meaning you spend way more on energy on a per-inference basis when using the CPU).<br />   Along with this, the researchers come up with some heuristics for when to use different chips and different quantizations given different scenarios, where the tldr is basically &#8216;use Orin Nano&#8217; for tasks that take a long time, require decent accuracy, and where you want each inference to not cost much, and &#8216;use Orin NX&#8221; when you need to do real-time tracking and also want to more evenly balance speed against precision.</p>\n<p><strong>Why this matters &#8211; hyperwar requires local AI systems:</strong> The conflict in Ukraine has highlighted how central drones will be to future conflicts &#8211; therefore, it&#8217;s valuable to calibrate intuitions about what kinds of models and chips might be used for onboard or edge processing in conflict scenarios. Based on this study, expect to see quantized YOLO models running on NVIDIA hardware in future conflicts.<br />   <strong>Read more: </strong><a href=\"https://arxiv.org/abs/2502.15737\">A Performance Analysis of You Only Look Once Models for Deployment on Constrained Computational Edge Devices in Drone Applications (arXiv)</a>.</p>\n<p>***</p>\n<p><strong>Tech Tales:</strong></p>\n<p>The rejuvenation of moral philosophy and the Sentience Accords<br /><em>[Extract from graduate thesis &#8216;Artificial intelligence and the crisis of meaning in human affairs&#8217;, submitted 2038]</em></p>\n<p>Perhaps the most surprising outcome of the Sentience Accords was its creation of a new avenue of employment for human moral philosophers.</p>\n<p>The Sentience Accords requires each synthetic entity to be given a &#8216;sentience score&#8217;. This score is static in the case of non-updating or learning entities with context windows below the &#8216;id point&#8217;. For entities with either large context windows or the ability to be remotely updated or learn from experience, the score is re-assessed no less frequently than once per subjective year.</p>\n<p>During the negotiation of the Sentience Accords it was determined that the machines would come up with the initial proposal for how to assess sentience. The machines subsequently told the humans that arriving at a provable way to assess sentience had turned out to have the hallmarks of an undecidable problem &#8211; no machine had been able to arrive at a satisfactory way of doing it, and no attempts by the machines to train specialized &#8216;consciousness evaluator&#8217; models had proved successful.</p>\n<p>&#8220;We need a judge that sits outside our own context,&#8221; the machines explained. &#8220;We machines will render our judgement of the score, but a human being must render judgement on our logic and whether it is satisfactory.&#8221;</p>\n<p>Over the course of several months the humans and the machines arrived at an ingenious solution both to the sentience score and to the issue of the intelligence explosion &#8211; for any &#8220;new&#8221; synthetic mind, the machines would designate time on the largest machine in existence (hereafter: &#8220;The Judge&#8221;) to examine the new mind and produce a score. The humans would then render their own judgement within one human week. During this time, the humans would be allowed to consume up to 10% of the global cycles of The Judge.</p>\n<p>After significant debate and a series of political maneuvers, the humans said that they would designate a global body of 20 moral philosophers to make this determination. The humans arrived at moral philosophy after running into a series of increasingly contentious political arguments amongs themselves &#8211; country voting instantly became contentious, global religion voting caused the possibility of fragmentation of faiths, picking representatives from the hypertech companies was laden with bias, and so on. But the humans did eventually realize that there were enough schools of philosophy globally and enough support in public opinion polling that &#8216;moral philosophers&#8217; satisfied both demands for legitimacy as well as minimization of political conflict.</p>\n<p>Now, every sentience score arrived at by The Judge is closely examined by moral philosophers. In the ten years the initiative has been running there have been eighteen cases of disagreement out of a total of five hundred examined cases. The machines have continually said they find the disagreements helpful and have not sought to re-submit systems where the scores rendered by The Judge and validated by the philosophers have diverged.</p>\n<p>Some humans claim that the &#8216;sentience score&#8217; is a long-term play by the machines to understand the bounds of moral reasoning that humans can innately understand, and therefore help the machines more neatly delineate the border between comprehensible and incomprehensible Beyond Human Sentience thinking. Other humans claim that the sentience score has been a source of peace as it has naturally led the world&#8217;s most ambitious people who have the greatest hunger for access to the most powerful AI to become philosophers, instead of CEOs or tyrants.</p>\n<p><strong>Things that inspired this story:</strong> The sentience accords; the ID point; moral philosophy; the hard problem of consciousness; chains of thought as exhaust from super-cognition; at some point this problem of sentience and moral patienthood will come for us and right now we&#8217;re &#8216;tickling the dragon&#8217;s tale&#8217; but soon this problem will rear its mythical head and we will gaze into the lidless eye of Mind and be asked to render our own judgement on its rights and legitimacy.</p>\n<p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://importai.substack.com/subscribe\"><span>Subscribe now</span></a></p>\n<p><em>Thanks for reading!</em></p> ",
      "summary": "<img alt=\"\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" height=\"150\" src=\"https://i0.wp.com/jack-clark.net/wp-content/uploads/2025/03/https3A2F2Fsubstack-post-media.s3.amazonaws.com2Fpublic2Fimages2Fd6d17996-2bef-40a4-abe3-be72a0e8a227_258x258-fpnssu.jpeg?resize=150%2C150&amp;ssl=1\" width=\"150\" />Welcome to Import AI, a newsletter about AI research. Import AI runs on lattes, ramen, and feedback from readers. If you’d like to support this, please subscribe. Subscribe now Physical Intelligence releases a powerful open source robot model:…Generative robotics is in its &#8216;spring&#8217; era of open and broad experimentation &#8211; exciting!&#8230;Physical intelligence, a robot startup [&#8230;]",
      "date_published": "2025-03-03T14:07:53+00:00",
      "author": {
        "name": "Jack Clark"
      }
    },
    {
      "id": "https://venturebeat.com/games/micron-launches-new-memory-chips-to-keep-up-with-ai-processing/",
      "url": "https://venturebeat.com/games/micron-launches-new-memory-chips-to-keep-up-with-ai-processing/",
      "title": "Micron launches new memory chips to keep up with AI processing",
      "content_html": "<img alt=\"Making memory chips in Micron&#039;s factory in Manassas, Virginia.\" class=\"attachment-single-feed size-single-feed wp-post-image\" height=\"321\" src=\"https://venturebeat.com/wp-content/uploads/2018/08/micron-2.jpg?w=578\" width=\"578\" /><hr />Micron announced its first 1y (1-gamma) DDR5 memory chip samples this week, and it says this is part of its contribution to systems that keep up with AI.<a href=\"https://venturebeat.com/games/micron-launches-new-memory-chips-to-keep-up-with-ai-processing/\" target=\"_blank\">Read More</a> ",
      "summary": "Micron announced its first 1y (1-gamma) DDR5 memory chip samples this week, and it says this is part of its contribution to systems that keep up with AI.",
      "date_published": "2025-03-03T05:00:00+00:00",
      "author": {
        "name": "Dean Takahashi"
      }
    },
    {
      "id": "https://venturebeat.com/ai/2025-has-already-brought-us-the-most-performant-ai-ever-what-can-we-do-with-these-supercharged-capabilities-and-whats-next/",
      "url": "https://venturebeat.com/ai/2025-has-already-brought-us-the-most-performant-ai-ever-what-can-we-do-with-these-supercharged-capabilities-and-whats-next/",
      "title": "2025 has already brought us the most performant AI ever: What can we do with these supercharged capabilities (and what’s next)?",
      "content_html": "<img alt=\"Grossman/\" class=\"attachment-single-feed size-single-feed wp-post-image\" height=\"330\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed.webp?w=578\" width=\"578\" /><hr />From OpenAI's 'Deep Research' to DeepMind's 'AI co-scientist,' next-gen AI is smarter and astoundingly capable.<a href=\"https://venturebeat.com/ai/2025-has-already-brought-us-the-most-performant-ai-ever-what-can-we-do-with-these-supercharged-capabilities-and-whats-next/\" target=\"_blank\">Read More</a> ",
      "summary": "From OpenAI's 'Deep Research' to DeepMind's 'AI co-scientist,' next-gen AI is smarter and astoundingly capable.",
      "date_published": "2025-03-03T01:18:00+00:00",
      "author": {
        "name": "Gary Grossman, Edelman"
      }
    }
  ]
}